Consultas -- Básico
===

In [1]:
%load_ext bigdata
%hive_init

Hive initialized!

---

In [2]:
%%hive
DROP DATABASE IF EXISTS SQLdb CASCADE;

CREATE DATABASE SQLdb;
USE SQLdb;

CREATE TABLE persons (
    id INT,
    firstname VARCHAR(10),
    surname VARCHAR(10),
    birthday DATE,
    color VARCHAR(10),
    quantity INT
);

INSERT INTO persons VALUES
    (1,"Vivian","Hamilton","1971-07-08","green",1),
    (2,"Karen","Holcomb","1974-05-23","green",4),
    (3,"Cody","Garrett","1973-04-22","orange",1),
    (4,"Roth","Fry","1975-01-29","black",1),
    (5,"Zoe","Conway","1974-07-03","blue",2),
    (6,"Gretchen","Kinney","1974-10-18","violea",1),
    (7,"Driscoll","Klein","1970-10-05","blue",5),
    (8,"Karyn","Diaz","1969-02-24","red",1),
    (9,"Merritt","Guy","1974-10-17","indigo",4),
    (10,"Kylan","Sexton","1975-02-28","black",4),
    (11,"Jordan","Estes","1969-12-07","indigo",4),
    (12,"Hope","Coffey","1973-12-24","green",5),
    (13,"Vivian","Crane","1970-08-27","gray",5),
    (14,"Clio","Noel","1972-12-12","red",5),
    (15,"Hope","Silva","1970-07-01","blue",5),
    (16,"Ayanna","Jarvis","1974-02-11","orange",5),
    (17,"Chanda","Boyer","1973-04-01","green",4),
    (18,"Chadwick","Knight","1973-04-29","yellow",1);

---

## Selección de datos

### SELECT

    SELECT what FROM tbl_name [WHERE where-conditions] [ORDER BY column_name];

In [3]:
%%hive
--
-- Este es el comando básico para visualizar el contenido de la BD
--
SELECT * FROM persons;

1	Vivian	Hamilton	1971-07-08	green	1
2	Karen	Holcomb	1974-05-23	green	4
3	Cody	Garrett	1973-04-22	orange	1
4	Roth	Fry	1975-01-29	black	1
5	Zoe	Conway	1974-07-03	blue	2
6	Gretchen	Kinney	1974-10-18	violea	1
7	Driscoll	Klein	1970-10-05	blue	5
8	Karyn	Diaz	1969-02-24	red	1
9	Merritt	Guy	1974-10-17	indigo	4
10	Kylan	Sexton	1975-02-28	black	4
11	Jordan	Estes	1969-12-07	indigo	4
12	Hope	Coffey	1973-12-24	green	5
13	Vivian	Crane	1970-08-27	gray	5
14	Clio	Noel	1972-12-12	red	5
15	Hope	Silva	1970-07-01	blue	5
16	Ayanna	Jarvis	1974-02-11	orange	5
17	Chanda	Boyer	1973-04-01	green	4
18	Chadwick	Knight	1973-04-29	yellow	1

In [4]:
%%hive
--
-- Selección de campos específicos
--
SELECT firstname, surname, birthday FROM persons;

Vivian	Hamilton	1971-07-08
Karen	Holcomb	1974-05-23
Cody	Garrett	1973-04-22
Roth	Fry	1975-01-29
Zoe	Conway	1974-07-03
Gretchen	Kinney	1974-10-18
Driscoll	Klein	1970-10-05
Karyn	Diaz	1969-02-24
Merritt	Guy	1974-10-17
Kylan	Sexton	1975-02-28
Jordan	Estes	1969-12-07
Hope	Coffey	1973-12-24
Vivian	Crane	1970-08-27
Clio	Noel	1972-12-12
Hope	Silva	1970-07-01
Ayanna	Jarvis	1974-02-11
Chanda	Boyer	1973-04-01
Chadwick	Knight	1973-04-29

### LIMIT

In [5]:
%%hive
--
-- Se limita la cantidad de registros a visualizar.
--
SELECT * FROM persons LIMIT 3;

1	Vivian	Hamilton	1971-07-08	green	1
2	Karen	Holcomb	1974-05-23	green	4
3	Cody	Garrett	1973-04-22	orange	1

In [6]:
%%hive
--
-- Grupo especifico de registros a visualizar
--
SELECT * FROM persons LIMIT 2,5;

3	Cody	Garrett	1973-04-22	orange	1
4	Roth	Fry	1975-01-29	black	1
5	Zoe	Conway	1974-07-03	blue	2
6	Gretchen	Kinney	1974-10-18	violea	1
7	Driscoll	Klein	1970-10-05	blue	5

### WHERE

In [7]:
%%hive
--
-- Condicional.
--
SELECT * FROM persons WHERE color = "blue";

5	Zoe	Conway	1974-07-03	blue	2
7	Driscoll	Klein	1970-10-05	blue	5
15	Hope	Silva	1970-07-01	blue	5

### Operadores relacionales

In [8]:
%%hive
--
-- Operadores relacionales
--
SELECT * FROM persons WHERE quantity > 2;

2	Karen	Holcomb	1974-05-23	green	4
7	Driscoll	Klein	1970-10-05	blue	5
9	Merritt	Guy	1974-10-17	indigo	4
10	Kylan	Sexton	1975-02-28	black	4
11	Jordan	Estes	1969-12-07	indigo	4
12	Hope	Coffey	1973-12-24	green	5
13	Vivian	Crane	1970-08-27	gray	5
14	Clio	Noel	1972-12-12	red	5
15	Hope	Silva	1970-07-01	blue	5
16	Ayanna	Jarvis	1974-02-11	orange	5
17	Chanda	Boyer	1973-04-01	green	4

In [9]:
%%hive
--
-- Condicional con fechas
--
SELECT * FROM persons WHERE birthday >= "1974-01-01";

2	Karen	Holcomb	1974-05-23	green	4
4	Roth	Fry	1975-01-29	black	1
5	Zoe	Conway	1974-07-03	blue	2
6	Gretchen	Kinney	1974-10-18	violea	1
9	Merritt	Guy	1974-10-17	indigo	4
10	Kylan	Sexton	1975-02-28	black	4
16	Ayanna	Jarvis	1974-02-11	orange	5

In [10]:
%%hive
--
-- resultados de condicionales
-- NO FUNCIONA EN HIVE
--
SELECT firstname, firstname < 'g', quantity, quantity >= 3 FROM persons;

Vivian	true	1	false
Karen	true	4	true
Cody	true	1	false
Roth	true	1	false
Zoe	true	2	false
Gretchen	true	1	false
Driscoll	true	5	true
Karyn	true	1	false
Merritt	true	4	true
Kylan	true	4	true
Jordan	true	4	true
Hope	true	5	true
Vivian	true	5	true
Clio	true	5	true
Hope	true	5	true
Ayanna	true	5	true
Chanda	true	4	true
Chadwick	true	1	false

In [11]:
%%hive
DROP TABLE IF EXISTS jointable;

CREATE TABLE  jointable (
    letter_id INT,
    letter VARCHAR(1)
);

INSERT INTO jointable VALUES
    (1,"A"),
    (2,"B"),
    (3,"C"),
    (24,"X"),
    (25,"Y"),
    (26,"Z");

SELECT * FROM jointable;

1	A
2	B
3	C
24	X
25	Y
26	Z

### Subconsultas

In [12]:
%%hive
SELECT * FROM jointable
WHERE letter_id = (SELECT id FROM persons WHERE firstname = 'Karen');

2	B

In [13]:
%%hive
--
-- Sub-consultas.
-- Busca la persona más vieja en la tabla.
--
SELECT * 
FROM 
    persons 
WHERE 
    birthday = (SELECT 
                    MIN(birthday) 
                FROM persons);

8	Karyn	Diaz	1969-02-24	red	1

---

> Otros ejemplos son presentados [aquí](https://github.com/jdvelasq/bash-for-analytics/blob/master/05-sql.ipynb)

----

### DISTINCT

In [14]:
%%hive
SELECT color FROM persons;

green
green
orange
black
blue
violea
blue
red
indigo
black
indigo
green
gray
red
blue
orange
green
yellow

In [15]:
%%hive
SELECT DISTINCT color FROM persons;

black
blue
gray
green
indigo
orange
red
violea
yellow

In [16]:
%%hive
--
-- Este comando permite ver los registro únicos de un campo.
--
SELECT DISTINCT surname FROM persons;

Boyer
Coffey
Conway
Crane
Diaz
Estes
Fry
Garrett
Guy
Hamilton
Holcomb
Jarvis
Kinney
Klein
Knight
Noel
Sexton
Silva

In [17]:
%%hive
SELECT DISTINCT YEAR(birthday), MONTH(birthday), DAYOFMONTH(birthday) FROM persons;

1969	2	24
1969	12	7
1970	7	1
1970	8	27
1970	10	5
1971	7	8
1972	12	12
1973	4	1
1973	4	22
1973	4	29
1973	12	24
1974	2	11
1974	5	23
1974	7	3
1974	10	17
1974	10	18
1975	1	29
1975	2	28

In [18]:
%%hive
--
-- numero de colores diferentes
--
SELECT COUNT(DISTINCT color) FROM persons;

9

### NULL

In [19]:
%%hive
DROP TABLE IF EXISTS nulltable;
CREATE TABLE  nulltable (
    col1 INT,
    col2 VARCHAR(1)
);

INSERT INTO nulltable VALUES
    (1,"A"),
    (2,NULL),
    (NULL,"C"),
    (NULL,NULL),
    (5,"E");

SELECT * FROM nulltable;

1	A
2	NULL
NULL	C
NULL	NULL
5	E

In [20]:
%%hive
SELECT * FROM nulltable WHERE col1 IS NULL;

NULL	C
NULL	NULL

In [21]:
%%hive
SELECT * FROM nulltable WHERE col2 IS NULL;

2	NULL
NULL	NULL

In [22]:
%%hive
--
-- condicionales
--
SELECT 
    IF(col1 IS NULL,'Unknown', col1), 
    IF(col2 IS NULL,'Unknown', col2) 
FROM 
    nulltable;

1	A
2	Unknown
Unknown	C
Unknown	Unknown
5	E

In [23]:
%%hive
--
-- condicionales
-- No existe en Hive
-- SELECT 
--     IFNULL(col1,'Unknown'), 
--     IFNULL(col2,'Unknown')
-- FROM 
--     nulltable;

### ORDER BY

In [24]:
%%hive
SELECT * FROM persons;

1	Vivian	Hamilton	1971-07-08	green	1
2	Karen	Holcomb	1974-05-23	green	4
3	Cody	Garrett	1973-04-22	orange	1
4	Roth	Fry	1975-01-29	black	1
5	Zoe	Conway	1974-07-03	blue	2
6	Gretchen	Kinney	1974-10-18	violea	1
7	Driscoll	Klein	1970-10-05	blue	5
8	Karyn	Diaz	1969-02-24	red	1
9	Merritt	Guy	1974-10-17	indigo	4
10	Kylan	Sexton	1975-02-28	black	4
11	Jordan	Estes	1969-12-07	indigo	4
12	Hope	Coffey	1973-12-24	green	5
13	Vivian	Crane	1970-08-27	gray	5
14	Clio	Noel	1972-12-12	red	5
15	Hope	Silva	1970-07-01	blue	5
16	Ayanna	Jarvis	1974-02-11	orange	5
17	Chanda	Boyer	1973-04-01	green	4
18	Chadwick	Knight	1973-04-29	yellow	1

In [25]:
%%hive
--
-- Selecciona el primer registro
--
SELECT * FROM persons ORDER BY birthday LIMIT 1;

8	Karyn	Diaz	1969-02-24	red	1

In [26]:
%%hive
--
-- Selecciona el último registro
--
SELECT * FROM persons ORDER BY birthday DESC LIMIT 1;

10	Kylan	Sexton	1975-02-28	black	4

In [27]:
%%hive
--
-- Selecciona una perte intermedia de los registros
--
SELECT * FROM persons ORDER BY birthday LIMIT 3,2;

13	Vivian	Crane	1970-08-27	gray	5
7	Driscoll	Klein	1970-10-05	blue	5

In [28]:
%%hive
--
-- Orden ascendente
--
SELECT * FROM persons WHERE quantity > 2 ORDER BY quantity, color;

10	Kylan	Sexton	1975-02-28	black	4
17	Chanda	Boyer	1973-04-01	green	4
2	Karen	Holcomb	1974-05-23	green	4
11	Jordan	Estes	1969-12-07	indigo	4
9	Merritt	Guy	1974-10-17	indigo	4
15	Hope	Silva	1970-07-01	blue	5
7	Driscoll	Klein	1970-10-05	blue	5
13	Vivian	Crane	1970-08-27	gray	5
12	Hope	Coffey	1973-12-24	green	5
16	Ayanna	Jarvis	1974-02-11	orange	5
14	Clio	Noel	1972-12-12	red	5

In [29]:
%%hive
--
-- Orden descendente en quantity
--
SELECT * FROM persons WHERE quantity > 2 ORDER BY quantity DESC, color;

15	Hope	Silva	1970-07-01	blue	5
7	Driscoll	Klein	1970-10-05	blue	5
13	Vivian	Crane	1970-08-27	gray	5
12	Hope	Coffey	1973-12-24	green	5
16	Ayanna	Jarvis	1974-02-11	orange	5
14	Clio	Noel	1972-12-12	red	5
10	Kylan	Sexton	1975-02-28	black	4
17	Chanda	Boyer	1973-04-01	green	4
2	Karen	Holcomb	1974-05-23	green	4
11	Jordan	Estes	1969-12-07	indigo	4
9	Merritt	Guy	1974-10-17	indigo	4

### JOIN

Los joins permiten unir la información de dos o más tablas. Los distintos tipos de joins son explicados en la siguiente gráfica:

![joins.jpg](images/joins.jpg)

In [30]:
%%hive
SELECT id, firstname, letter
FROM persons INNER JOIN jointable ON id = letter_id;

1	Vivian	A
2	Karen	B
3	Cody	C

### INSERT OVERWRITE

In [31]:
!mkdir output

In [32]:
%%hive
INSERT OVERWRITE LOCAL DIRECTORY 
    '/tmp/output' 
ROW FORMAT 
DELIMITED FIELDS TERMINATED BY ',' 
SELECT * FROM persons;

In [33]:
!ls /tmp/output/*

/tmp/output/000000_0

In [34]:
!cat /tmp/output/000000_0

1,Vivian,Hamilton,1971-07-08,green,1
2,Karen,Holcomb,1974-05-23,green,4
3,Cody,Garrett,1973-04-22,orange,1
4,Roth,Fry,1975-01-29,black,1
5,Zoe,Conway,1974-07-03,blue,2
6,Gretchen,Kinney,1974-10-18,violea,1
7,Driscoll,Klein,1970-10-05,blue,5
8,Karyn,Diaz,1969-02-24,red,1
9,Merritt,Guy,1974-10-17,indigo,4
10,Kylan,Sexton,1975-02-28,black,4
11,Jordan,Estes,1969-12-07,indigo,4
12,Hope,Coffey,1973-12-24,green,5
13,Vivian,Crane,1970-08-27,gray,5
14,Clio,Noel,1972-12-12,red,5
15,Hope,Silva,1970-07-01,blue,5
16,Ayanna,Jarvis,1974-02-11,orange,5
17,Chanda,Boyer,1973-04-01,green,4
18,Chadwick,Knight,1973-04-29,yellow,1

In [35]:
!rm -rf /tmp/ouput

---